In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "name": ["Alice", "bob", "Charlie", "alice", "Eve", "Frank", "Grace", "Bob", "Heidi", "Ivan"],
    "department": ["HR", "IT", "IT", "HR", "Finance", "IT", "Finance", "IT", "HR", "Finance"],
    "salary": [50000, 70000, 70000, 52000, None, 90000, 65000, 70000, 52000, None],
    "experience": [2, 5, 5, 2, 3, 8, 4, 5, 2, 1],
    "join_date": pd.to_datetime([
        "2022-01-10", "2021-06-15", "2021-06-15",
        "2022-01-10", "2023-03-01", "2019-11-20",
        "2020-07-07", "2021-06-15", "2022-01-10", "2024-02-01"
    ]),
    "is_active": [True, True, False, True, True, False, True, True, False, True]
}

df = pd.DataFrame(data)

In [ ]:
df.isna().mean().mul(100)

In [ ]:
df["emp_id"].duplicated().mean() * 100

### QUESTIONS :-

#### Display only name, salary, and department

In [3]:
df.columns

Index(['emp_id', 'name', 'department', 'salary', 'experience', 'join_date',
       'is_active'],
      dtype='object')

In [8]:
df[['name', 'salary', 'department']]

      name   salary department
0    Alice  50000.0         HR
1      bob  70000.0         IT
2  Charlie  70000.0         IT
3    alice  52000.0         HR
4      Eve      NaN    Finance
5    Frank  90000.0         IT
6    Grace  65000.0    Finance
7      Bob  70000.0         IT
8    Heidi  52000.0         HR
9     Ivan      NaN    Finance

#### Show employees whose salary is missing, but display only emp_id and department.

In [11]:
df.loc[df['salary'].isna(), ['emp_id', 'salary', 'department']]

   emp_id  salary department
4     105     NaN    Finance
9     110     NaN    Finance

#### Filter employees who are inactive and belong to IT department.

In [15]:
df[(df['is_active'] == False) & (df['department'] == 'IT')]

   emp_id     name department   salary  experience  join_date  is_active
2     103  Charlie         IT  70000.0           5 2021-06-15      False
5     106    Frank         IT  90000.0           8 2019-11-20      False

#### Display rows where experience is less than 3 OR salary is greater than 80,000 and sort result in desc order of salary

In [25]:
df[(df['experience'] < 3) | (df['salary'] > 80000)].sort_values(by='salary', ascending=False)

   emp_id   name department   salary  experience  join_date  is_active  new
5     106  Frank         IT  90000.0           8 2019-11-20      False    6
3     104  alice         HR  52000.0           2 2022-01-10       True    3
8     109  Heidi         HR  52000.0           2 2022-01-10      False    3
0     101  Alice         HR  50000.0           2 2022-01-10       True    3
9     110   Ivan    Finance      NaN           1 2024-02-01       True    1

- Show specific cols

In [28]:
df.loc[
    (df['experience'] < 3) | (df['salary'] > 80000), 
    ['emp_id', 'salary']
].sort_values(by='salary', ascending=False)

   emp_id   salary
5     106  90000.0
3     104  52000.0
8     109  52000.0
0     101  50000.0
9     110      NaN

#### Find employees whose name starts with “A” or “a” (case-insensitive).

In [33]:
df[df['name'].str.lower().str.startswith('a')]

   emp_id   name department   salary  experience  join_date  is_active  new
0     101  Alice         HR  50000.0           2 2022-01-10       True    3
3     104  alice         HR  52000.0           2 2022-01-10       True    3

#### Show all employees not from the Finance department.

In [44]:
df.loc[
    df['department'] != 'Finance', 
    ['emp_id', 'name', 'department', 'salary']
]

   emp_id     name department   salary
0     101    Alice         HR  50000.0
1     102      bob         IT  70000.0
2     103  Charlie         IT  70000.0
3     104    alice         HR  52000.0
5     106    Frank         IT  90000.0
7     108      Bob         IT  70000.0
8     109    Heidi         HR  52000.0

#### Return only rows where salary exists AND is_active is True.

In [49]:
df[(df['salary'].notna()) & (df['is_active'] == True)]

# df.loc[(df['salary'].notna()) & (df['is_active'] == True), ['emp_id']]

   emp_id   name department   salary  experience  join_date  is_active  new
0     101  Alice         HR  50000.0           2 2022-01-10       True    3
1     102    bob         IT  70000.0           5 2021-06-15       True    4
3     104  alice         HR  52000.0           2 2022-01-10       True    3
6     107  Grace    Finance  65000.0           4 2020-07-07       True    5
7     108    Bob         IT  70000.0           5 2021-06-15       True    4

#### Display employees who joined after 2021-12-31.

In [55]:
# -- simple version
# df[df['join_date'] > '2021-12-31'] 

# -- Selective Version
df.loc[df['join_date'] > '2021-12-31', ['emp_id', 'name', 'join_date']]

   emp_id   name  join_date
0     101  Alice 2022-01-10
3     104  alice 2022-01-10
4     105    Eve 2023-03-01
8     109  Heidi 2022-01-10
9     110   Ivan 2024-02-01

#### Show duplicate employees based on name + department combination.

In [57]:
df[df.duplicated(subset= ['name', 'department'], keep=False)]

Empty DataFrame
Columns: [emp_id, name, department, salary, experience, join_date, is_active, new]
Index: []

#### Fetch rows where salary equals the maximum salary in the dataset.

In [59]:
df[df['salary'] == df['salary'].max()]

   emp_id   name department   salary  experience  join_date  is_active  new
5     106  Frank         IT  90000.0           8 2019-11-20      False    6

#### Display employees whose experience is exactly one of {2, 5}.

In [65]:
df[df['experience'].isin([2,5])]

# -- Selective Version
# df.loc[df['experience'].isin([2, 5]), ['emp_id', 'experience']]

   emp_id     name department   salary  experience  join_date  is_active  new
0     101    Alice         HR  50000.0           2 2022-01-10       True    3
1     102      bob         IT  70000.0           5 2021-06-15       True    4
2     103  Charlie         IT  70000.0           5 2021-06-15      False    4
3     104    alice         HR  52000.0           2 2022-01-10       True    3
7     108      Bob         IT  70000.0           5 2021-06-15       True    4
8     109    Heidi         HR  52000.0           2 2022-01-10      False    3

#### Select employees where name contains “bo”, regardless of case.

In [66]:
df[df['name'].str.contains('bo', case=False)]

   emp_id name department   salary  experience  join_date  is_active  new
1     102  bob         IT  70000.0           5 2021-06-15       True    4
7     108  Bob         IT  70000.0           5 2021-06-15       True    4

#### Filter rows where salary is missing OR employee is inactive.

In [67]:
df[df['salary'].isna() | df['is_active'] == False]

   emp_id     name department   salary  experience  join_date  is_active  new
2     103  Charlie         IT  70000.0           5 2021-06-15      False    4
5     106    Frank         IT  90000.0           8 2019-11-20      False    6
8     109    Heidi         HR  52000.0           2 2022-01-10      False    3

#### Display only the first 3 active employees (based on join_date asc).
- It helps to find loyal employees

In [70]:
df[df['is_active'] == True].sort_values(by='join_date').head(3)

   emp_id   name department   salary  experience  join_date  is_active  new
6     107  Grace    Finance  65000.0           4 2020-07-07       True    5
1     102    bob         IT  70000.0           5 2021-06-15       True    4
7     108    Bob         IT  70000.0           5 2021-06-15       True    4

#### Show employees whose department is HR AND salary is below department average

In [74]:
hr_avg_sal = df.loc[df['department'] == 'HR', 'salary'].mean()

df[(df['department'] == 'HR') & (df['salary'] < hr_avg_sal)]

   emp_id   name department   salary  experience  join_date  is_active  new
0     101  Alice         HR  50000.0           2 2022-01-10       True    3

#### Find 2nd highest salary

In [89]:
second_highest_salary = df[df['salary'].rank(method='dense', ascending=False) == 2]
second_highest_salary

,emp_id,name,department,salary,experience,join_date,is_active,new,years_served
1,102,bob,IT,70000.0,5,2021-06-15,True,4,4
2,103,Charlie,IT,70000.0,5,2021-06-15,False,4,4
7,108,Bob,IT,70000.0,5,2021-06-15,True,4,4

#### 2nd highest salary from each department

In [91]:
result = df[
    df.groupby("department")["salary"]
      .rank(method="dense", ascending=False) == 2
]
result

,emp_id,name,department,salary,experience,join_date,is_active,new,years_served
0,101,Alice,HR,50000.0,2,2022-01-10,True,3,3
1,102,bob,IT,70000.0,5,2021-06-15,True,4,4
2,103,Charlie,IT,70000.0,5,2021-06-15,False,4,4
7,108,Bob,IT,70000.0,5,2021-06-15,True,4,4

#### Find the years a emp has served the company

In [78]:
from datetime import date

today = pd.Timestamp.today().normalize()
df['years_served'] = (today - df['join_date']).dt.days // 365
df[['emp_id', 'join_date', 'years_served']]

   emp_id  join_date  years_served
0     101 2022-01-10             3
1     102 2021-06-15             4
2     103 2021-06-15             4
3     104 2022-01-10             3
4     105 2023-03-01             2
5     106 2019-11-20             6
6     107 2020-07-07             5
7     108 2021-06-15             4
8     109 2022-01-10             3
9     110 2024-02-01             1

#### Rank employees by years_served department-wise

In [86]:
df.assign(
    dept_rank=df.groupby('department')['years_served']
                 .rank(method='dense', ascending=False)
).sort_values(
    ['department', 'dept_rank'],
    ascending=[True, True]
)[['emp_id', 'department', 'years_served', 'join_date', 'dept_rank']]

   emp_id department  years_served  join_date  dept_rank
6     107    Finance             5 2020-07-07        1.0
4     105    Finance             2 2023-03-01        2.0
9     110    Finance             1 2024-02-01        3.0
0     101         HR             3 2022-01-10        1.0
3     104         HR             3 2022-01-10        1.0
8     109         HR             3 2022-01-10        1.0
5     106         IT             6 2019-11-20        1.0
1     102         IT             4 2021-06-15        2.0
2     103         IT             4 2021-06-15        2.0
7     108         IT             4 2021-06-15        2.0